УНФ_ТЕСТ/src/InformationRegisters/ПросмотрСобытий/ПросмотрСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПросмотрСобытий</name>
  <resources>
    <name>Просмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>DocumentRef.Событие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/ПросмотрСобытий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьОжиданиеПросмотра(Событие) Экспорт
	
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПросмотрСобытий) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Просмотрено = Ложь;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ОтметитьКакПросмотрено(Событие) Экспорт
	
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПросмотрСобытий.Просмотрено КАК Просмотрено
	|ИЗ
	|	РегистрСведений.ПросмотрСобытий КАК ПросмотрСобытий
	|ГДЕ
	|	ПросмотрСобытий.Событие = &Событие
	|	И НЕ ПросмотрСобытий.Просмотрено");
	Запрос.УстановитьПараметр("Событие", Событие);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПросмотрСобытий) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Просмотрено = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗапись(Событие) Экспорт
	
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПросмотрСобытий) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
